from Program import Program
from Building import Building
from Room import Room
from Lecturer import Lecturer
from Student import Student


program_gi = Program("GI", "ภูมิสารสนเทศ", "Geoinformatics")


b4 = Building("4", "คณะวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ")


a9012071 = Room("434", "ปฏิบัติการคอมพิวเตอร์ 2", b4)
a9043011 = Room("436", "ปฏิบัติการระบบสารสนเทศภูมิศาสตร์ 2", b4)
a9043073 = Room("436", "ปฏิบัติการภูมิสารสนเทศด้านการสาธารณสุข", b4)
a9042032 = Room("437", "ปฏิบัติการดาวเทียมนำทางบนโลกขั้นสูง", b4)
a9043051 = Room("433", "ห้องปฏิบัติการเขียนโปรแกรมภาษาสมัยใหม่", b4)
a9043021 = Room("434", "ปฏิบัติการการรับรู้จากระยะไกล 2", b4)
a9043091 = Room("436", "ห้องสัมมนาทางภูมิสารสนเทศ 1", b4)

d9012071 = Lecturer("อาจารย์", "นิทัศน์", "นิลฉวี", program_gi)
d9043011 = Lecturer("ผู้ช่วยศาสตราจารย์", "วิระ", "ศรีมาลา", program_gi)
d9043073 = Lecturer("ผู้ช่วยศาสตราจารย์", "วิระ", "ศรีมาลา", program_gi)
d9042032 = Lecturer("ผู้ช่วยศาสตราจารย์", "วิระ", "ศรีมาลา", program_gi)
d9043051 = Lecturer("ผู้ช่วยศาสตราจารย์ ดร.", "คัมภีร์", "ธีระเวช", program_gi)
d9043091 = Lecturer("ผู้ช่วยศาสตราจารย์ ดร.", "คัมภีร์", "ธีระเวช", program_gi)
d9043021 = Lecturer("ผู้ช่วยศาสตราจารย์", "ทบทอง", "ชั้นเจริญ", program_gi)

w9012071 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)
w9043011 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)
w9043073 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)
w9042032 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)
w9043051 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)
w9043091 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)
w9043021 = Student("6714931017", "นายปรเมษฐ์", "ไวยาประโคน", program_gi)


print("=== ข้อมูลห้องเรียน ===")
print(a9012071)
print(a9043011)
print(a9043073)
print(a9042032)
print(a9043051)
print(a9043021)
print(a9043091)

print("\n=== ข้อมูลอาจารย์ ===")
print(d9012071)
print(d9043011)
print(d9043073)
print(d9042032)
print(d9043051)
print(d9043091)
print(d9043021)

print("\n=== ข้อมูลนักศึกษา ===")
print(w9012071)
print(w9043011)
print(w9043073)
print(w9042032)
print(w9043051)
print(w9043091)
print(w9043021)